## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.name.azurecaf_name.this["main_rg"] will be created
  + resource "azurecaf_name" "this" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "dev"
      + passthrough   = false
      + prefixes      = [
          + "ch",
        ]
      + random_length = 3
      + random_string = "yod"
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "eastus",
        ]
      + use_slug      = true
    }

  # module.resource_group.azurerm_resource_group.this["main_rg"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = (known after apply)
      + tags     = {
          + "dept"       = "dev"
          + "intent"     = "dev environment provisioning"
          + "managed_by" = "terraform"
          + "owner"      = "DevOps"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + names           = {
      + main_rg = {
          + clean_input    = true
          + id             = (known after apply)
          + name           = "dev"
          + passthrough    = false
          + prefixes       = [
              + "ch",
            ]
          + random_length  = 3
          + random_seed    = null
          + random_string  = "yod"
          + resource_type  = "azurerm_resource_group"
          + resource_types = null
          + result         = (known after apply)
          + results        = (known after apply)
          + separator      = "-"
          + suffixes       = [
              + "eastus",
            ]
          + use_slug       = true
        }
    }
  + resource_groups = {
      + main_rg = {
          + id         = (known after apply)
          + location   = "eastus"
          + managed_by = null
          + name       = (known after apply)
          + tags       = {
              + dept       = "dev"
              + intent     = "dev environment provisioning"
              + managed_by = "terraform"
              + owner      = "DevOps"
            }
          + timeouts   = null
        }
    }
  + tags            = {
      + dept       = "dev"
      + intent     = "dev environment provisioning"
      + managed_by = "terraform"
      + owner      = "DevOps"
    }
```
</details>